import {Injectable} from '@angular/core';
import {Http} from '@angular/http';

@Injectable()
export class Content {
  value = 'בשבילי';
  constructor(public http: Http) {

  }

  getData() {
    console.log('Title#getData(): Get Data');
    // return this.http.get('/assets/data.json')
    // .map(res => res.json());
    return {
      value: `<p><span class='about-highlight'>שלום לך!</span>
</p><p>
<span class="about-highlight">שמי גלית פרידמן, מכוונת נשים לפוריות. עכשיו שבאת, אוכל לספר לך מה הביא אותי לכאן.</span>
</p><p>
כבר לפני כמה שנים, לאחר הלידה הראשונה, הבנתי שהשליחות שלי היא להיות כתובת עבור כל אישה העומדת מול אתגרי הפוריות, במטרה לעזור לה למצוא את הדרך שלה להתמודד עם ההמתנה הזו בשמחה, ברוגע ובשלמות עם עצמה. יש לי שיטה ייחודית לעזור לך להחזיר לעצמך את שמחת החיים, את הביטחון שלך בעצמך ובגופך ואת החופש לחיות חיים נורמאליים למרות אתגרי הפוריות שנכפו עליך.
</p><p>
<span class="about-highlight">את המקום הזה אני מכירה מקרוב. </span> הראשונה שעברתי איתה תהליך משמעותי היא אני בעצמי . זמן קצר לאחר שנישאתי לאיש שלי נכנסתי לעולם הפוריות המאתגר. בדרך שעברתי למדתי להגיע לשביל הנכון לי, לחיות גם כשטרם נוצרו חיים בתוכי ולהיות שמחה ובטוחה במה שאני בלי קשר לתוצאות הבטא. הדרך הזו הניבה לי עד היום שלוש פירות בטן מתוקים שאני גאה להיות אמא שלהם, ושל אלה, בע"ה, שיבואו אחריהם.
</p><p>
<span class="about-highlight">את ניסיוני היקר</span> אני משלבת עם כיוון (אימון יהודי) שלמדתי במכללת "כוונה", שם קיבלתי כלים מעשיים המשלבים את עולם האימון עם עולם המקורות היהודיים שלנו והופכים את הדרך ליצירת שינוי בכל רובדי החיים לפשוטה, בהירה ומעשית. למדתי הנחיית קבוצות ובנוסף אני מרצה כבר מגיל 7 (את הסטאז' עשיתי על הבובות שלי) והיום, אל דאגה, אני מדברת בפני קהל נשים. לא אשמיט את העובדה שאני בעלת תואר ראשון בחינוך והוראת אנגלית, ידיעת האנגלית משמשת אותי בחיים והחינוך עוזר לי, בעיקר, לחנך את עצמי!
</p><p>
<span class="about-highlight">מכוונת? </span> הרבה שואלים מה זה וגם האם זה סתם נשמע טוב או שיש מאחורי זה משמעות מיוחדת? אז כן! כמכוונת אני מכוונת אותך להיות קשובה לעצמך להיפגש עם עצמך, עם הכוחות והעצות שכבר טמונים בך. מה שאת הכי צריכה זה לא עצות, או מטרות נוספות או שיגידו לך מה לעשות. אלא מישהי שתכוון אותך, בקצב שלך, להגיע ליעד שלך בצורה הכי טובה לך. חשוב לי להיות קשובה למילים שלך וגם... לשתיקות. הכלים שעומדים לרשותי מאפשרים לי לתת לך את המענה המדויק לך.
</p><p>
<span class="about-highlight">אני מודה</span> על הכישרון המבורך שקיבלתי להגיע לעומקם של דברים, לא להסתפק באקמול, פתרון מהיר ושטחי, אלא לאחוז בשורש הדבר ומשם לצמוח ולהצמיח באמת. יש לי סיפוק גדול לראות אישה צומחת ומתעצמת לנוכח הקושי, איך היא הופכת את חייה לפוריים וכהמשך לכל זה, גם חובקת חיים חדשים. אני יודעת היטב עד כמה זה משמעותי שיהיה איפה לפרוק ולכאוב כשצריך ללא שיפוטיות ולשמוח גם מהדברים הכי קטנים. לכן בתהליך אני משקיעה ביצירת מרחב כף זכות, הקשבה, עין טובה והמון רגישות ואמפתיה.
</p><p>
<span class="about-highlight">העבודה איתי</span> נעשית בתהליך אישי או בסדנא קבוצתית בהנחייתי. אבל, בעיני, שניהם יחד זה השילוב המנצח! מי כמוך יודעת, כשמחכים להריון שלא מגיע בקלות, חווים קושי ובלבול גדול. בתהליך אנחנו עושות סדר במחשבות, ברגשות וברצונות, נוגעות בנקודות החזקות והאיכותיות שבך על מנת שתהיה לנו קרקע פורייה לצמוח ממנה ורק אז מתחילות להקשיב בעדינות למה שקורה בתוכך ומטלטל את חייך. אחר כך ליצור אצלך איזון פשוט בין הגוף לנפש ולהפוך את השינויים הפנימיים לתוצאות במציאות היומיומית שלך. מכאן ואילך השמיים הם הגבול, החיים סוף סוף זורמים, רגועים ופוריים.
</p><p>
<span class="about-highlight">אני מאמינה</span> שגוף ונפש משפיעים זה על זה בצורה מאוד חזקה, במיוחד בפוריות. השינוי שמתחולל בנפש משפיע ישירות על הגוף. עלינו להאמין שיש לנו את הכוח והיכולת לבחור ברגשות ומחשבות הרצויים לנו לנוכח כל קושי. התמדה, סבלנות והוקרת כל צעד קטן יעזרו לנו להפוך את חיינו לזורמים ופוריים כפי שאנחנו רוצות. הסיכויים של אישה שחיה חיים פוריים ושמחים להביא חיים לעולם גבוהים בהרבה! ובכלל, אני מאמינה שכל אתגר שנשלח אלינו, לא הגיע בטעות אלא יש לו תפקיד לעזור לנו להתקדם ולפתח את המידות שלנו. גם באתגר הזה יש הזדמנות לצמיחה וללמידה חדשה אם רק מתבוננים על המקום הזה ומוכנים לצאת למסע אישי. ואז הרווח כפול – נפש פורייה וגוף פורה!
</p><p>
<span class="about-highlight">אז שתהיה לנו דרך צלחה! </span>
</p><p>
<span class="about-highlight">שלך באהבה, גלית. </span>
</p><p>
אם עדיין לא קיבלת את החוברת <a href="">"בדרך לחיים חדשים</a>" לחצי וקבלי אותה חינם!
</p><p>
אני מזמינה אותך לשיחת ייעוץ חינם בה נתאים לך את התהליך שלך בקצב הנכון לך.
</p><p>
כבר שמעת על הספר החדש שלי "החיים שבתוכך"? בעזרתו תצליחי לגלות את הדרך שלך להתמודד מול אתגרי הפוריות בשמחה, ברוגע ובשלמות עם עצמך. תוכלי להזמין אותו בפורמט דיגיטלי או מודפס.
</p><p>
אם עדיין לא שמעת את ההרצאה שלי "שבעת השלבים לצאת מנצחת מכל קושי" אשמח להגיע ולהעביר אותה לכלל הנשים באזור מגורייך.
</p>`
    };
  }

}
